{
    "rule_number": 44,
    "rule_name": "INVASION",
    "rule_text": "Invasion is a step of the tactical action during which the active player can land ground forces on planets to gain control of those planets.   To resolve an invasion, players perform the following steps:   44.1 STEP 1-BOMBARDMENT: The active player may use the 'Bombardment' ability of any of his units in the active system.   44.2 STEP 2-COMMIT GROUND FORCES: If the active player has ground forces in the space area of the active system, he may commit any number of those ground forces to land on any of the planets in that system.         To commit a ground force to a planet, the active player places that ground force unit on that planet.       The planet may contain another player's ground forces.       If the active player does not wish to commit ground forces, he proceeds to the 'Production' step of the tactical action.     44.3 STEP 3-SPACE CANNON DEFENSE: If the active player commits any ground forces to a planet that contains units that have the 'Space Cannon' ability, those 'Space Cannon' abilities can be used against the committed ground forces.    If the active player committed ground forces to more than one planet that contained units with a 'Space Cannon' ability, the active player chooses the order in which those 'Space Cannon' abilities are resolved.    44.4 STEP 4-GROUND COMBAT: If the active player commits ground forces to land on a planet that contains another player's ground forces, those players resolve a ground combat on that planet.    If players must resolve a combat on more than one planet, the active player chooses the order in which those combats are resolved.    44.5 STEP 5-ESTABLISH CONTROL: The active player gains control of each planet he committed ground forces to that still contains at least one of his ground forces.         When a player gains control of a planet, any structures on the planet that belong to other players are immediately destroyed.       When a player gains control of a planet, he gains the planet card that matches that planet and exhausts that card.       A player cannot gain control of a planet he already controls.       If there was a combat, and all units belonging to both players were destroyed, the player who was the defender retains control of the planet and places one of his control markers on the planet.           Bombardment       Combat       Control       Ground Combat       Ground Forces       Opponent       PDS       Planets"
}