{
    "rule_number": 104,
    "rule_name": "ACTION CARDS (FAQ)",
    "rule_text": "Q:  Is the 'Skilled Retreat' action card considered to be a retreat and can it be canceled by the action card 'Intercept?'?    A:  No, 'Skilled Retreat' is not a retreat and cannot be canceled in this way.      Q:  Can 'Sustain Damage' be used against the 'Courageous to the End' action card?    A:  No, 'Courageous to the End' does not produce hits.      Q:  Can two 'Direct Hit' action cards be played by the same player on the same round of combat against different targets?    A:  Yes. Because the two 'Direct Hit' cards are targeting different targets, this is allowed.      Q:  During space combat, can each player play a 'Shields Holding' action card to cancel hits against his units, even though they are being played during the same timing window?    A:  Yes. Because each of the 'Shields Holding' cards are targeting different sets of hits (one set against player A and one set against player B), it is legal to play both cards.      Q:  Can the 'Shields Holding' action card be used to cancel hits from abilities that occur during combat, such as 'Ambush,' 'Dimensional Splicer,' and 'Devotion?'    A:  Yes. 'Shields Holding' may be used to cancel hits that are produced by these abilities.      Q:  Can the 'Direct Hit' action cards be played when a ship uses 'Sustain Damage' to cancel a hit produced by one of your abilities?    A:  Yes. 'Direct Hit' can be used to follow up hits that are assigned by 'Ambush,' 'Dimensional Splicer,' 'Devotion,' and other similar abilities.      Q:  Does an effect that casts 'additional votes,' such as the 'Bribery' action card, create a timing window for playing the 'Distinguished Councilor' action card?    A:  No. The 'Distinguished Councilor' action card can only be played after you vote during the 'Vote' step of resolving an agenda.      Q:  When during the action card playing process is a 'Sabotage' card played?    A:  The 'Sabotage' action can be played after card targets (such as units, planets, systems, cards, outcomes, or players) have been decided on, but must be played before any effects have been resolved, votes have been cast, or any dice have been rolled.      Q:  Can abilities that destroy units, such as the 'Lucky Shot' action card, be used by a player against his own units or planets?    A:  No. 'Lucky Shot' and other similar effects can only be used against other player’s units and planets.      Q:  Can multiple rider action cards be played by the same player on a single agenda? If so, can they be played on different outcomes?    A:  Yes to both. A player may play multiple rider action cards on a single agenda, and they may be played on opposing outcomes.      Q:  When playing the 'Upgrade' action card, does the cruiser already have to be present in the active system?    A:  Yes. The cruiser must already be in the activated system.      Q:  Can the 'Experimental Battlestation' action card be used if no ships move into the active system, or against ships that do not belong to the active player?    A:  No. 'Experimental Battlestation' operates in the same timing window as 'Space Cannon Offense,' can only target the active player’s ships, and can only be resolved if ships actually move into the active system.      Q:  Can a player who cannot vote (such as the Nekro Virus) play rider action cards?    A:  Yes. The Nekro player, or a player who cannot vote due to another effect, can still play rider action cards.      Q:  If the speaker does not vote, can the 'Bribery' action card still be played?    A:  Yes, even if the speaker cannot vote, or chooses not to vote, the 'Bribery' action card (or any effect with the timing window of 'after the speaker votes') can still be played after the timing window in which the speaker would have cast votes."
}