{
    "rule_number": 79,
    "rule_name": "TECHNOLOGY",
    "rule_text": "Technology cards allow players to upgrade units and acquire powerful abilities.   79.1 Each player places any technologies he has gained faceup near his faction sheet. He owns those cards for the duration of the game and can use their abilities.   79.2 A player does not own the technology cards in histechnology deck.   79.3 A player can gain technology cards from his technology deck by researching technology.    Both the primary and secondary abilities of the 'Technology' strategy card allow a player to research a technology.    79.4 Any technology cards that a player has not gained remain in his technology deck. A player can look through his technology deck at any time.   79.5 If an ability instructs a player to gain a technology, he does not research it; he takes it from his technology deck and places it in his play area, ignoring prerequisites.   79.6 Some technologies are unit upgrades. Unit upgrades share a name with a unit that is printed on a player's faction sheet.    Players place any unit upgrades they gain faceup on their faction sheets, covering the unit that shares a name with that upgrade card.    79.7 Each technology that is not a unit upgrade has a colored symbol displayed in the lower-right corner of the card and on its card back that indicates that technology's color.         A technology's color has no inherent game effect; however, each technology a player owns can satisfy a prerequisite of a matching color when researching other technology.       Unit upgrades do not have a color and do not satisfy prerequisites.       There are four colors of technologies as shown in the Rule Reference manual     79.8 Most technology cards have a column of colored symbols displayed in the lower-left corner of the card. Each symbol in this column is a prerequisite.    A technology card's prerequisites indicate the number and color of technologies a player must own to research that technology card.    79.9 RESEARCHING TECHNOLOGY   A player can research technology by resolving either the primary or secondary ability of the 'Technology' strategy card during the action phase. Other game effects may also instruct a player to research technology.   79.10 To research technology, a player gains that technology card from his technology deck and places it in his play area near his faction sheet.    Players place any unit upgrades they gain faceup on their faction sheets, covering the unit that shares a name with that upgrade card.    79.11 A player cannot research a faction technology that does not match his faction.   79.12 When researching technology, a player must satisfy each of a technology's prerequisites to research it. To satisfy a technology's prerequisites, he must own one technology of the matching color for each prerequisite symbol on the technology card he wishes to research.         Prerequisites symbols are displayed as symbols on the lower-left corner of the card.       Unit upgrade technologies do not have a color and do not satisfy prerequisites.       Players may use certain abilities or technology specialties to ignore some prerequisites.     79.13 TECHNOLOGY SPECIALTIES   A technology specialty is a technology symbol found on some planets.   79.14 When researching technology, a player can exhaust a planet he controls that has a technology specialty to ignore one prerequisite symbol of the matching type on the technology card he is researching.   79.15 If the planet card is already exhausted, it cannot be used to ignore a prerequisite.   79.16 VALEFAR ASSIMILATOR   The Nekro Virus faction can use its faction abilities in combination with its two 'Valefar Assimilator' faction technologies to gain faction technologies that have been researched by other players, including unit upgrades.   79.17 Basic units printed on faction sheets are not technologies and are not eligible targets for 'Valefar Assimilator.'   79.18 If a player is eliminated while one of his technologies has a Valefar Assimilator token on it, the Nekro Virus player places that technology in his play area; it is not removed from the game.   79.19 If a Valefar Assimilator token is removed from the Saar 'Floating Factory' unit upgrade, each of the Nekro Virus’ space docks must be placed on an eligible planet he controls in that space dock’s system, or the space dock is returned to his reinforcements.   79.20 If a Valefar Assimilator token is removed from a war sun unit upgrade and the Nekro Virus does not have the standard war sun unit upgrade, each of Nekro Virus’ war suns are returned to his reinforcements.   79.21 The Nekro Virus may upgrade his units with units of the same type (e.g., 'dreadnought' or 'infantry') even if their names do not match. If the Nekro Virus gains a unit upgrade technology of the same unit type as a unit upgrade technology he already has, the previous upgrade is removed, and he must use the same Valefar Assimilator token as was used to copy the previous upgrade.   79.22 When a Valefar Assimilator token is on a technology, that technology’s color and type count toward objectives         Command Tokens       Exhausted       Initiative Order       Resources       Strategic Action       Strategy Card       Technology (Strategy Card)       Unit Upgrades"
}