{
    "rule_number": 2,
    "rule_name": "ACTION CARDS",
    "rule_text": "Action cards provide players with various abilities that they can resolve as described on the cards.   2.1 Each player draws one action card during each status phase.   2.2 Players can draw action cards by resolving the primary and secondary abilities of the 'Politics' strategy card.   2.3 When a player draws an action card, he takes the top card from the action card deck and adds it to his hand of action cards.   2.4 Each player can have a maximum of seven action cards in his hand at any time. If a player ever has more than seven action cards, he must choose which seven cards he wishes to keep and discard the rest.    A game effect can increase or decrease the number of cards a player can have in his hand.    2.5 A player's action cards remain hidden from other players until they are played.   2.6 The first paragraph of each action card is presented in bold text and describes the timing of when that card's ability can be resolved.         If an action card contains the word 'Action', a player must use a component action during the action phase to resolve the ability. A player cannot resolve a component action if he cannot completely resolve its ability.       Multiple action cards with the same name cannot be played during a single timing window to affect the same units or game effect. Canceled cards do not count as being played.     2.7 To play an action card, a player reads and resolves the card's ability text, making any decisions as prompted by the card. Then, he discards the card, placing it in the action discard pile.   2.8 If an action card is canceled, that card has no effect and is discarded.   2.9 During the action phase, if two or more action cards or other abilities would be resolved during the same timing window, players should use the timing rules on page 4 to determine the correct order of resolution.   2.10 During the strategy and agenda phases, if two or more action cards or other abilities would be resolved during the same timing window, players should use the timing rules on page 4 to determine the correct order of resolution         Abilities       Component Action       Politics       Status Phase"
}