{
    "rule_number": 1,
    "rule_name": "ABILITIES",
    "rule_text": "Cards and faction sheets each have abilities that players can resolve to trigger various game effects.   1.1 Each ability describes when and how a player can resolve it.    If an ability with a specified duration is resolved, the effect of the ability remains through that duration, even if the component that caused the ability is removed.    1.2 If a card has multiple abilities, each ability is presented as its own paragraph.   1.3 If an ability begins with a bolded 'Action', a player must use a component action during the action phase to resolve that ability.   1.4 If an ability uses the word 'cannot', that effect is absolute.   1.5 When a player resolves an ability, he must resolve the ability in its entirety. Any parts of the ability preceded by the word 'may' are optional, and the player resolving the ability may choose not to resolve those parts.   1.6 Abilities on components that remain in play are mandatory unless they use the word 'may.'   1.7 If an ability has multiple effects separated by the word 'and', a player must resolve as many of the ability's effects as possible. However, if he cannot resolve all of its effects, he is allowed to resolve as many as he can.   1.8 COSTS   1.9 Some abilities have a cost that is followed by an effect. The cost of an ability is separated from the effect by the word 'to' or by a semicolon. A player cannot resolve the effect of such an ability if he cannot resolve that ability's cost.   1.10 Some examples of an ability's cost include spending resources, spending trade goods, spending command tokens, exhausting cards, and activating specific systems.   1.11 TIMING   1.12 If the timing of an ability uses the word 'before' or 'after', the ability's effect occurs immediately before or after the described timing event, respectively.         For example, if an ability is resolved 'after a ship is destroyed', the ability must be resolved as soon as the ship is destroyed and not later during that turn or round.       After the last round of a combat, abilities that occur 'after a round of combat' and 'after combat ends' occur during the same timing window. Likewise, at the start of the firstround of combat, abilities that occur 'at the start of combat' and 'at the start of a round of combat' occur during the same timing window. The order of resolution for these abilities follows the rules established in the timing section.     1.13 If the timing of an ability uses the word 'when', the ability's effect occurs at the moment of the described timing event.    Such an ability typically modifies or replaces the timing event in some way.    1.14 Effects that occur 'when' an event happens take priority over effects that occur 'after' an event happens.   If an ability uses the word 'then,' a player must resolve the effect that occurs before the word 'then' or he cannot resolve the effect that occurs after the word 'then.'   1.16 Each ability can be resolved once for each occurrence of that ability's timing event. For example, if an ability is resolved 'At the start of combat', it can be resolved at the start of each combat.   1.17 COMPONENT-SPECIFIC RULES   1.18 The opening paragraph of each ability found on an action card describes when a player can resolve that card's ability.   1.19 The opening paragraph of most abilities found on promissory notes describes when a player can resolve that card's ability.    Some promissory notes have abilities that trigger as soon as a player receives the card.    1.20 Abilities on agenda cards correspond to an outcome. Players resolve these abilities during the agenda phase after players vote for a particular outcome.   1.21 Each faction has faction abilities presented on its faction sheet. Each faction's flagship has one or more unique abilities. Some abilities provide players with perpetual effects.   1.22 Some units have unit abilities. These abilities are named and presented above a unit's attributes on a player's faction sheet or on a unit upgrade card. Each unit ability has unique rules for when a player can resolve that ability. The following abilities are unit abilities:         Anti-Fighter Barrage       Bombardment       Planetary Shield       Production       Space Cannon       Sustain Damage     1.23 If a unit's ability uses the phrase 'this system' or 'this planet', the ability is referring to the system or planet that contains that unit.         Action Cards       Promissory Notes       Strategy Card       Technology"
}