{
    "rule_number": 106,
    "rule_name": "THE NEKRO VIRUS (FAQ)",
    "rule_text": "Q:  Can the Nekro Virus use the 'Valefar Assimilator' technologies on printed faction units such as the Embers of Muaat's Prototype War Sun I?    A:  No, printed faction units are not technologies, and thus are ineligible targets for 'Valefar Assimilator.'      Q:  Do infantry involved in a space combat via the effects of 'The Alastor' flagship count as ships for the purpose of card effects and fleet supply?    A:  Infantry that are participating in space combat via 'The Alastor' do count as ships (in addition to their own unit type) for the purpose of card effects, but, as a unit that can be transported, they do not count against fleet supply in that system.      Q:  Do infantry involved in a space combat due to the effects of 'The Alastor' flagship cease participation in combat if the Alastor is destroyed?    A:  No. Infantry that are committed to the space combat due to the effects of 'The Alastor' continue to participate until the end of the combat, even if 'The Alastor' is destroyed.      Q:  Can the Nekro Virus have both a standard and a faction-specific unit upgrade of the same type?    A:  Yes. Only the faction-specific unit upgrade technology will be in effect, but should the Nekro lose the faction-specific upgrade technology that is being copied by the 'Valefar Assimilator,' he would revert to the standard unit upgrade technology that was previously inactive.      Q:  If the Nekro Virus owns multiple unit upgrade technologies of the same type, such as 'Dreadnought II' and 'Exotrireme II,' does each one count toward the 'Develop Weaponry' and 'Revolutionize Warfare' objectives?    A:  No. Only one upgrade of a given type counts toward those objectives.      Q:  Do infantry involved in a space combat via the effects of 'The Alastor' flagship count toward the ships required to use the 'Assault Cannon' technology?    A:  Yes. These infantry may be used to resolve 'Assault Cannon.'      Q:  Does the Winnu 'Salai Sai Corian' flagship get additional dice for infantry participating in a fight due to the Nekro 'Alastor' flagship?    A:  Yes. The 'Salai Sai Corian' would get one additional die per infantry"
}