{
    "rule_number": 103,
    "rule_name": "AGENDAS (FAQ)",
    "rule_text": "Q:  When a 'Research Team' agenda that is attached to a planet is used to ignore a prerequisite, is the planet exhausted?    A:  No. The agenda is exhausted to ignore the prerequisite, not the planet.      Q:  Can a player cast '0' votes 'For' or 'Against' on an agenda instead of abstaining, in order to take advantage of effects associated with that option?    A:  No. A vote of '0' is the same as abstaining; that player gains no positive or negative effects of voting 'For' or 'Against' on an agenda if he contributed '0' votes.      Q:  Does the 'Enforced Travel Ban' agenda prevent 'Space Cannon' usage through wormholes?    A:  No. 'Enforce Travel Ban' does not prevent 'Space Cannon' usage.      Q:  If the 'Classified Document Leaks' agenda is discarded, what happens?    A:  The secret objective remains in play; it is no longer a public objective and cannot by scored by any additional players, but it does not count toward the secret objective total of the player who originally owned it.      Q:  During a revote initiated by the 'Miscount Disclosed' agenda, does the law that is being voted on remain active and in play?    A:  Yes, the law that is being voted on because of 'Miscount Disclosed' remains in play during the revote.      Q:  If there is an ‘A’ wormhole on Mecatol Rex when the 'Ixthian Artifact' agenda causes units in adjacent systems to be destroyed, does the Quantum Entanglement ability cause the Ghost of Creuss faction to lose units in a system that contains a ‘B’ wormhole?    A:  No. Only the Creuss treats those systems as adjacent.      Q:  When units are destroyed by the 'Ixthian Artifact' agenda, in what order are they destroyed?    A:  Units destroyed by 'Ixthian Artifact' are destroyed simultaneously.      Q:  If a player’s 'Political Secret' promissory note is used against them, but that agenda is subsequently discarded by an effect such as the 'Veto' action card, can that player vote and use faction abilities on the new agenda?    A:  Yes. It is a new agenda and thus the effect of the player’s 'Political Secret' is ended.      Q:  Can the 'Colonial Redistribution' agenda elect a planet that is already the target of 'Demilitarized Zone,' and if so, can the chosen player place infantry to take control of the planet?    A:  Both agendas may target the same planet. However, in that situation, infantry cannot be placed on the elected planet, so it remains under the control of its original owner.      Q:  When the 'Holy Planet of Ixth,' 'Shard of the Throne,' or 'The Crown of Emphidia' agendas are repealed, does the player who owns them lose a victory point?    A:  No, the player who gained a victory point from these agendas can only lose that point through the effect stated on the card. If the card is discarded in any other way, such as the 'Repeal Law' action card, the point is not lost.      Q:  Is the trigger for the 'Minister of War' agenda card’s ability 'performing an action'?    A:  Yes. Performing any action is the trigger for the remainder of the 'Minister of War' agenda card’s ability."
}