{
    "rule_number": 31,
    "rule_name": "ELIMINATION",
    "rule_text": "A player who is eliminated is no longer part of the game.   31.1 A player is eliminated when he meets all of the following three conditions:         The player has no ground forces on the game board.       The player has no unit that has 'Production.'       The player does not control any planets.     31.2 When a player becomes eliminated, all of the units, command tokens, control tokens, promissory notes, technologies, command sheets, as well as the faction sheet that matches his faction or color are returned to the game box, including those in his reinforcements.   31.3 When a player becomes eliminated, all agenda cards he owns are discarded.   31.4 When a player becomes eliminated, each promissory note he has that matches another player's faction or color is returned to that player.    Promissory notes that match the eliminated player are returned to the game box, even if another player has them.    31.5 When a player becomes eliminated, all action cards in his hand are discarded.   31.6 When a player becomes eliminated, his strategy cards are returned to the common play area whether they have been exhausted or not.   31.7 When a player becomes eliminated, his secret objectives are shuffled back into the secret objective deck whether they have been completed or not.   31.8 If the speaker becomes eliminated, the speaker token passes to the player to his left.   31.9 If a game that started with five or more players becomes a game with four or fewer players due to elimination, the players continue to select only one strategy card during the strategy phase.   31.10 When players are eliminated, faction-specific tokens interact with the game as follows:         If a player becomes eliminated and the Nekro Virus’ assimilator 'X' or assimilator 'Y' token is placed on one of his faction technologies, that technology remains in play.       If the Ghost of Creuss player becomes eliminated, his wormhole tokens remain on the game board for the remainder of the game.       If the Naalu player becomes eliminated while another player has the Naalu player’s '0' token, that token remains with its current player until the end of the status phase, and then it is removed from play.             Agenda Card       Control       Ground Forces       Production       Promissory Notes"
}