{
    "rule_number": 70,
    "rule_name": "STATUS PHASE",
    "rule_text": "During the status phase, players score objectives and prepare for the next game round. To resolve the status phase, players perform the following steps:   70.1 STEP 1-SCORE OBJECTIVES: Following initiative order, each player may score up to one public objective and one secret objective that can be fulfilled during the status phase. To score an objective, he must fulfill the requirements on the card; if he does, he gains a number of victory points indicated on the card.   70.2 STEP 2-REVEAL PUBLIC OBJECTIVE: The speaker reveals an unrevealed public objective card by flipping that card faceup.         The speaker cannot reveal 'Stage II' objectives until all 'Stage I' objectives are revealed.       The game ends if there are no unrevealed public objectives at the start of this step.     70.3 STEP 3-DRAW ACTION CARDS: Following initiative order, each player draws one action card.   70.4 STEP 4-REMOVE COMMAND TOKENS: Each player removes all of his command tokens from the game board and returns them to his reinforcements.   70.5 STEP 5-GAIN AND REDISTRIBUTE COMMAND TOKENS: Each player gains two command tokens from his reinforcements. Then, he can redistribute all of the command tokens on his command sheet, including the two he just gained, among his strategy, tactic, and fleet pools.         Players should remember to check the number of their ships in each system after reducing the size of their fleet pools.       This step can usually be resolved simultaneously, but if there is a timing conflict, it is resolved in initiative order.     70.6 STEP 6-READY CARDS: Each player readies all of his exhausted cards, including strategy cards.   70.7 STEP 7-REPAIR UNITS: Each player repairs all of his units that have the 'Sustain Damage' ability by turning those units upright.   70.8 STEP 8-RETURN STRATEGY CARDS: Each player returns his strategy card to the common play area. Then, if a player has removed the custodians token from Mecatol Rex, the game round continues to the agenda phase. Otherwise, a new game round begins with the strategy phase.         Action Cards       Agenda Phase       Custodians Token       Command Tokens       Game Round       Objective Cards       Readied       Sustain Damage       Strategy Card       Strategy Phase"
}