{
    "rule_number": 101,
    "rule_name": "GENERAL (FAQ)",
    "rule_text": "Q:  Are the '0' faces of the ten-sided dice included with the game intended to represent the result of a '10'?    A:  Yes, the '0' face is a '10' result.      Q:  How should a space combat be resolved if it is mathematically impossible for either side to win—for example, certain configurations of ships using the 'Non-Euclidean Shielding' and 'Duranium Armor' technologies in concert?    A:  If neither side has the potential to win, the attacker must retreat.      Q:  Can fighters block ship movement?    A:  Yes, fighters can block ship movement (this was added as a correction in the Living Rules Reference version 1.1).      Q:  Does each unit participating in Bombardment or Space Cannon roll an additional die for the Plasma Scoring technology?    A:  No. 'Plasma Scoring' only grants one additional die for each 'Bombardment' or 'Space Cannon' roll, and the unit benefitting from this technology must be decided before rolling.      Q:  Does 'Planetary Shield' prevent the use of 'X-89 Bacterial Weapon'?    A:  No. 'X-89 Bacterial Weapon' is not part of bombardment, so it is not prevented by 'Planetary Shield.'      Q:  Can units be picked up and transported off of planets when using abilities that move ships, such as the 'Skilled Retreat' action card or 'Foresight' faction ability?    A:  Yes. Any effect that moves a ship allows that ship to transport units in its system, if it has available capacity.      Q:  Can you intentionally reveal hidden information to another player, such as an action card from your hand or your secret objective?    A:  Yes. This information is kept hidden by default, but it is permissible to reveal it to another player or players as a strategic option.      Q:  What happens to infantry that would be placed on a planet in any player’s home system by the effect of the 'Infantry II' unit upgrade technology if the player does not own any planets in his home system?    A:  When those infantry would be placed on a home planet, they are returned to that player’s reinforcements instead.      Q:  Can a card (such as a promissory note) with a specified timing of a certain window that is acquired from a transaction during that window be played immediately?    A:  Yes. For example, a promissory note with 'At the start of your turn:' timing may be immediately played if the transaction occurred within the 'start of turn' timing window.      Q:  When the player resolving the 'Trade' strategy card selects another player to resolve the 'Trade' secondary ability for free, does the player resolving the effect for free do so during the execution of the primary ability or the secondary ability?    A:  He must resolve this effect during the resolution of the secondary ability as normal, but he does not have to spend a command token to do so.      Q:  If a player would refresh his commodities but already has the maximum amount, can another player still play that player’s 'Trade Agreement' promissory note against him?    A:  Yes. Even if that player gains zero commodities when he refreshes them, his 'Trade Agreement' may still be played against him.      Q:  Does the 'Neural Motivator' technology give an additional action card for both the standard status phase draw as well as the 'Minister of Policy' agenda? What about the Yssaril’s 'Scheming' faction ability?    A:  No. 'Neural Motivator' gives only one action card in addition to the standard status phase draw. It is not triggered additional times by other abilities. The Yssaril’s 'Schemeing' ability, however, is triggered each time that action cards are drawn.      Q:  Does the 'Political Secret' promissory note disable passive/mandatory faction abilities, such as the Barony of Letnev’s 'Armada' faction ability, when it is used against that player?    A:  No. The 'Political Secret' promissory note only prevents the use of faction abilities that a player must choose to use.      Q:  Does the 'Political Secret' promissory note prevent a player from using faction-specific technology?    A:  No. The 'Political Secret' promissory note does not prevent a player from using faction-specific technology, nor does it prevent the use of other abilities, such as those from agendas that a player might own.      Q:  Can the 'Turn Their Fleets to Dust' objective be fulfilled by using a 'Direct Hit' action card or by destroying a unit with capacity and allowing transported fighters to be removed as a result?    A:  No. In both situations, the 'Space Cannon' ability did not destroy the last ship in the system, so the objective is not fulfilled.      Q:  If a player has multiple planets with PDS that are being invaded in a single system, does the 'Plasma Scoring' technology add one die to each planet’s space cannon roll or for only one planet’s space cannon roll?    A:  The 'Plasma Scoring' technology adds one die for each space planet’s 'Space Cannon' roll."
}