{
    "rule_number": 67,
    "rule_name": "SPACE COMBAT",
    "rule_text": "After resolving the 'Space Cannon Offense' step of a tactical action, if two players have ships in the active system, those players must resolve a space combat.   67.1 If the active player is the only player with ships in the system, he skips the 'Space Combat' step of the tactical action and proceeds to the 'Invasion' step.   67. 2 If an ability occurs 'before combat', it occurs immediately before the 'Anti-Fighter Barrage' step.   To resolve a space combat, players perform the following steps:   67. 3 STEP 1-ANTI-FIGHTER BARRAGE: If this is the first round of a space combat, the players may simultaneously use the 'Anti-Fighter Barrage' ability of any of their units in the active system.         If one or both players no longer have ships in the active system after resolving this step, the space combat ends immediately.       Players cannot resolve 'Anti-Fighter Barrage' abilities during any rounds of space combat other than the first round.     67.4 STEP 2-ANNOUNCE RETREATS: Each player may announce a retreat, beginning with the defender.         A retreat will not occur immediately; the units will retreat during the 'Retreat' step.       If the defender announces a retreat, the attacker cannot announce a retreat during that combat round.       A player cannot announce a retreat if there is not at least one eligible system to retreat to.     67. 5 STEP 3-ROLL DICE: Each player rolls one die for each ship he has in the active system; this is called a combat roll. If a unit's combat roll produces a result that is equal to or greater than that unit's combat value, that result produces a hit.         If a unit's combat value contains two or more burst icons, the player rolls one die for each burst icon instead.       If a player has ships that have different combat values in the active system, he rolls these dice separately.     - First, he should roll all dice for his units with a combat value of '1.' Then, he should roll all dice for his units with combat value of '2', and then '3', continuing in numerical order until he has rolled dice for each of his ships.   - A player keeps track of the number of hits his combat rolls produce. The total number of hits he produces will destroy units during the 'Assign Hits' step.23    -If a player has an ability that rerolls a die or affects a die after it is rolled, he must resolve that ability immediately after rolling the die. For example, if the player made a combat roll for his dreadnoughts, he must decide if he wants to use an ability to reroll those dice before making a combat roll for his destroyers.   - The attacker makes all of his combat rolls during this step before the defender. This procedure is important for abilities that allow a player to reroll an opponent's die.   67.6 STEP 4-ASSIGN HITS: Each player must choose and destroy one of his ships in the active system for each hit his opponent produced.         Before assigning hits, players may use their units' 'Sustain Damage' abilities to cancel hits.       When a unit is destroyed, the player who controls that unit removes it from the board and places it in his reinforcements.     67.7 STEP 5-RETREAT: If a player announced a retreat during the first step of a combat, and there is still an eligible system for his units to retreat to, he must retreat.         If a player announced a retreat during the 'Announce Retreats' step and if his opponent has no ships left in the system, the combat immediately ends and the retreat does not occur.       To retreat, a player takes all of his ships in the combat that have a move value and moves them to an adjacent system. That player’s fighters and ground forces in the space area of the active system that are unable to move or be transported are destroyed.       The system that a player's units retreat to must contain one or more of his units, a planet he controls, or both. Additionally, the system cannot contain ships controlled by another player.       If any units successfully retreat and are moved into an adjacent system, the player must place a command token from his reinforcements in the system to which he retreated. If that system already contains one of his command tokens, he does not place an additional token there. If the player has no command tokens in his reinforcements, he must use one from his command sheet instead.     67.8 After the 'Retreat' step, if both players still have ships in the active system, they resolve another round of space combat beginning with the 'Announce Retreats' step.   67.9 Space combat ends immediately when only one player-or neither player-has a ship in the space area of the active system.    'End of combat' and 'end of combat round' effects still occur.    67.10 After a combat ends, the player with one or more ships remaining in the system is the winner of the combat; the other player is the loser of the combat. If neither player has a ship remaining, the combat ends in a draw and there is no winner.    If the winner of the combat has fighters or ground forces in space that exceed his ships' capacity in the active system, he must destroy the excess units of his choice.          Capacity       Fleet Pool       Opponent       Sustain Damage       Tactical Action       Transport"
}