{
    "rule_number": 66,
    "rule_name": "SPACE CANNON (UNIT ABILITY)",
    "rule_text": "A unit that has the 'Space Cannon' ability can use it during two different steps of a player's tactical action: after the 'Move Ships' substep (Space Cannon Offense) and during an invasion (Space Cannon Defense).   66.1 A player is not required to be the active player to use the 'Space Cannon' abilities of his units.   66.2 SPACE CANNON OFFENSE   During a tactical action, after the 'Move Ships' substep of the 'Movement' step, players can resolve the 'Space Cannon' abilities of their units by performing the following steps:   66.3 STEP 1 - ROLL DICE: The player rolls dice for each of his units in the active system that has the 'Space Cannon' ability; this is a space cannon roll. One hit is produced for each result that is equal to or greater than the unit’s 'Space Cannon' value.         If a unit has a 'Space Cannon' ability, it is present on its faction sheet and technology cards.       'Space Cannon' is displayed as 'Space Cannon X (Y).' The X is the minimum value needed for a die to produce a hit, and Y is the number of dice rolled. Not all 'Space Cannon' abilities are accompanied by a (Y) value; a space cannon roll for such a unit consists of one die.       If a player has the 'Deep Space Cannon' technology, he can use the 'Space Cannon' ability of his PDS units that are in systems that are adjacent to the active system. The hits are still assigned to units in the active system.       Game effects that reroll, modify, or otherwise affect combat rolls do not affect space cannon rolls.     66.4 This ability can be used even if no ships were moved during the 'Move Ships' step.   66.5 STEP 2 - ASSIGN HITS: The player whose units have been targeted by 'Space Cannon' must choose and destroy one of his ships in the active system for each hit result produced against his units.          Players other than the active player must target the active player’s units       If the active player is using the 'Space Cannon' ability of his units, he chooses a player who has ships in the active system. That player must choose and destroy one of his ships in the active system for each hit the space cannon roll produced.     66.6 SPACE CANNON DEFENSE   During a tactical action, after the 'Move Ships' substep of the 'Movement' step, beginning with the active player and proceeding clockwise, each player may use the 'Space Cannon' ability of each of his units in the active system by performing the following steps:   66.7 STEP 1-Each player may use the 'Space Cannon' ability of each of his units on the invaded planet by rolling a specific number of dice for each of those units; this is called a space cannon roll. A hit is produced for each die roll that is equal to or greater than the unit's 'Space Cannon' value.         If a unit has a 'Space Cannon' ability, it is present on its faction sheet and technology cards.       'Space Cannon' is displayed as 'Space Cannon X (Y).' The X is the minimum value needed for a die to produce a hit, and Y is the number of dice rolled. Not all 'Space Cannon' abilities are accompanied by a (Y) value; a space cannon roll for such a unit consists of one die.       Game effects that reroll, modify, or otherwise affect combat rolls do not affect space cannon rolls.       Game effects that allow the use of 'Space Cannon' abilities against ships in adjacent systems have no effect during Space Cannon Defense.     66.8 STEP 2 - The active player must choose and destroy one of his ground forces on the planet for each hit the space cannon roll produced.    Hits can only be assigned to units that were committed to the same planet as the units using the 'Space Cannon' ability.          Active System       Attacker       Defender       Destroyed       Invasion       Sustain Damage       Movement       Tactical Action"
}